app/views/stories/_show_stories.html.erb

SELECT COUNT(*) FROM "stories"
---
            <h6>
              There <%= @stories.count > 1 ? "are" : "is" %> <%= pluralize(@stories.count, "story") %> with that <%= @active_button %>

SELECT COUNT(*) FROM "stories"
---
            <h6>
              There <%= @stories.count > 1 ? "are" : "is" %> <%= pluralize(@stories.count, "story") %> that <%= @stories.count > 1 ? "have" : "has" %> comments