app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures" ORDER BY "pictures"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pictures"
---
  def index
    @pictures = Picture.all.order(created_at: :asc).paginate(:page => params[:page], :per_page => 3)