app/controllers/welcome_controller.rb

SELECT  "stories".* FROM "stories" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 3]]
SELECT  "pictures".* FROM "pictures" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."commentable_type" = $1 ORDER BY "comments"."created_at" DESC  [["commentable_type", "User"]]
---
  def welcome
    @stories = Story.order("RANDOM()").limit(3)
    @pictures = Picture.order("RANDOM()").limit(3)
    @videos = Video.order("RANDOM()").limit(3)
    @story_recordings = Recording.where(recordable_type: "Story").order("RANDOM()").limit(3)
    @user_recordings = Recording.where(recordable_type: "User").order("RANDOM()").limit(5)
    @guestbook_comments = Comment.where(commentable_type: "User")