app/models/story.rb

SELECT "stories".* FROM "stories" ORDER BY "stories"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def self.get_metadata
    Story.find_each do |story|

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."story_id" = $1  [["story_id", 7]]
---
  def all_tags
    self.tags.map(&:name).join(", ")